app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("office_id", "doctor_id", "doctor_name", "doctor_surname", "patient_id", "patient_name", "patient_surname", "appointment_date", "start_Time", "end_Time", "appointment_Purpose", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "start_Time" = ?, "end_Time" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["start_Time", "2019-09-11 18:01:00"], ["end_Time", "2019-09-11 18:50:00"], ["updated_at", "2019-09-13 02:43:41.738308"], ["id", 7]]