app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "surname", "id_number", "cellphone_number", "specialty_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save