app/controllers/office_types_controller.rb

  def index
    @office_types = OfficeType.all
---
SELECT "office_types".* FROM "office_types"

  def create
    @office_type = OfficeType.new(office_type_params)

    respond_to do |format|
      if @office_type.save
---
INSERT INTO "office_types" ("officeType_id", "officeType_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["officeType_id", 1], ["officeType_name", "Optometry"], ["created_at", "2019-09-10 18:18:55.679194"], ["updated_at", "2019-09-10 18:18:55.679194"]]

    def set_office_type
      @office_type = OfficeType.find(params[:id])
---
SELECT "office_types".* FROM "office_types" WHERE "office_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]