app/controllers/offices_controller.rb

  def index
    @offices = Office.all
---
SELECT "offices".* FROM "offices"

  def create
    @office = Office.new(office_params)

    respond_to do |format|
      if @office.save
---
INSERT INTO "offices" ("code", "name", "location", "office_type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", "1"], ["name", "Chiropractic 1"], ["location", "A Building"], ["office_type_id", 3], ["created_at", "2019-09-10 18:19:32.148883"], ["updated_at", "2019-09-10 18:19:32.148883"]]

    def set_office
      @office = Office.find(params[:id])
---
SELECT "offices".* FROM "offices" WHERE "offices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]