app/controllers/patients_controller.rb

INSERT INTO "patients" ("name", "surname", "birth_date", "id_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pepito"], ["surname", "Perez"], ["birth_date", "2014-01-01"], ["id_number", 1], ["created_at", "2019-09-10 18:18:17.950010"], ["updated_at", "2019-09-10 18:18:17.950010"]]
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save