app/controllers/specialties_controller.rb

SELECT "specialties".* FROM "specialties"
---
  def index
    @specialties = Specialty.all

INSERT INTO "specialties" ("specialty_id", "profession", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["specialty_id", 1], ["profession", "Optometrist"], ["created_at", "2019-09-10 18:17:29.001862"], ["updated_at", "2019-09-10 18:17:29.001862"]]
---
  def create
    @specialty = Specialty.new(specialty_params)

    respond_to do |format|
      if @specialty.save

SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_specialty
      @specialty = Specialty.find(params[:id])